# Контрольная работа. Ковалевская Наталья

## Поэтапный план выполнения задания 

1. Создать репозиторий в Гит, сопрячь его с файлами на компе, все проверить 
2. Составить блоксхему программы целиком 
3. Написать план выполнения в READMe 
4. Написать саму программу согласно Блоксхеме. 
5. Дать описание работы программы по шагам.

## Описание програмного решения 

Для решения основного задания я выбрала тот вариант программы, при котором пользователь задает массив слов с консоли, тк по моему мнению это самый эффективный способ для тестирования. Программа состоит из 6 частей.

В *первой* части программы мы выводим сообщение пользователю о необходимости ввода числа слов в изначальном массиве.

Во *второй* части мы создаем Первый массив, с количеством слов которое пользователь ввел ранее, а затем его заполняем.

В *третьей* части используя проверку на "пустое заполнение" мы принимаем поочередно значения для каждлого "слова" в массиве.

В *четвертой* части программы мы создаем дополнительный счетчик со значением ноль для слов меньше 3 символов, а также сам второй массив строк для отсортированных слов, при том длина второго массива строк равна длине первого массива строк.

В *пятой* части с помощью for мы сортируем первый массив строк и слова с длинной в два или меньше символов мы добавляем по порядку во второй массив строк, при том после каждого прохождения цикла добавления мы прибавляем единицу к числу счетчика второга массива строк, созданного ранее.

В *шестой* части программы мы выводим второй массив строк с отсортированными словами длинной меньше или равной трем символам. по скольку слова в массив мы записывали по порядку и при том их число отображенно в дополнительном счетчике второго массива, то мы выводим второй массив строк до тех пор, пока счетчик цикла вывода меньше дополнительного счетчика второго массива строк. (i < secondArrayIndex)

Таким образом, в заключение, программа выполняет поставленное задание а также имеет дополнительный функционал для ввода первого массива с консоли и проверки введенных слов а в случае чего дает возможность ввести слово заново, без вылета программы, что делает ее удобной для тестирования.

## Задание 

СДАВАТЬ ССЫЛКОЙ НА GITHUB Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе Разработчик. Мы должны убедится, что базовое знакомство с IT прошло успешно.

Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

* Создать репозиторий на GitHub

* Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)

* Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)

* Написать программу, решающую поставленную задачу

* Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

> Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями,лучше обойтись исключительно массивами.

Примеры: [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”] [“1234”, “1567”, “-2”, “computer science”] → [“-2”] [“Russia”, “Denmark”, “Kazan”] → [] Console.WriteLine("Hello, World!");